<a href="https://colab.research.google.com/github/noo-nine/Machine-Learning/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Installation

conda install pandas

# DataFrames

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.DataFrame(np.random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [ ]:
df

          W         X         Y         Z
A -1.714969 -0.200637 -0.446755 -1.380459
B -2.533718  0.945276 -0.147050 -1.393195
C  1.413018  0.031659  1.029154 -0.793943
D -0.662689  0.177411  2.338913  1.300502
E  1.400226  1.009983  0.626337  0.752276

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [ ]:
df.iloc[:,2:3]

          Y
A -0.446755
B -0.147050
C  1.029154
D  2.338913
E  0.626337

In [ ]:
# Pass a list of column names
df[['W','Z']]

          W         Z
A -1.714969 -1.380459
B -2.533718 -1.393195
C  1.413018 -0.793943
D -0.662689  1.300502
E  1.400226  0.752276

In [ ]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A   -1.714969
B   -2.533718
C    1.413018
D   -0.662689
E    1.400226
Name: W, dtype: float64

DataFrame Columns are just Series

In [ ]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [ ]:
df['new'] = df['W'] + df['Y']

In [ ]:
df

          W         X         Y         Z       new
A -1.714969 -0.200637 -0.446755 -1.380459 -2.161724
B -2.533718  0.945276 -0.147050 -1.393195 -2.680768
C  1.413018  0.031659  1.029154 -0.793943  2.442172
D -0.662689  0.177411  2.338913  1.300502  1.676223
E  1.400226  1.009983  0.626337  0.752276  2.026563

** Removing Columns**

In [ ]:
df.drop('new',axis=1)

          W         X         Y         Z
A -1.714969 -0.200637 -0.446755 -1.380459
B -2.533718  0.945276 -0.147050 -1.393195
C  1.413018  0.031659  1.029154 -0.793943
D -0.662689  0.177411  2.338913  1.300502
E  1.400226  1.009983  0.626337  0.752276

In [ ]:
df1 = df.drop('A',axis=0)
df1

          W         X         Y         Z       new
B -2.533718  0.945276 -0.147050 -1.393195 -2.680768
C  1.413018  0.031659  1.029154 -0.793943  2.442172
D -0.662689  0.177411  2.338913  1.300502  1.676223
E  1.400226  1.009983  0.626337  0.752276  2.026563

In [ ]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A -1.714969 -0.200637 -0.446755 -1.380459 -2.161724
B -2.533718  0.945276 -0.147050 -1.393195 -2.680768
C  1.413018  0.031659  1.029154 -0.793943  2.442172
D -0.662689  0.177411  2.338913  1.300502  1.676223
E  1.400226  1.009983  0.626337  0.752276  2.026563

In [ ]:
df1

          W         X         Y         Z       new
B -2.533718  0.945276 -0.147050 -1.393195 -2.680768
C  1.413018  0.031659  1.029154 -0.793943  2.442172
D -0.662689  0.177411  2.338913  1.300502  1.676223
E  1.400226  1.009983  0.626337  0.752276  2.026563

In [ ]:
df.drop('W',1,inplace=True)

C:\Users\DELL\AppData\Local\Temp\ipykernel_12660\965711835.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  df.drop('W',1,inplace=True)

In [ ]:
df.drop?

Can also drop rows this way:

In [ ]:
df.drop('E',axis=0)

          X         Y         Z       new
A -0.529688  0.146518 -0.425011  1.320873
B -0.468972  0.323547  0.650965 -1.096610
C -0.289836 -0.763281  0.964985 -0.018077
D  1.321038 -0.218712 -0.352165 -0.005339

** Selecting Rows**

In [ ]:
df.loc['A']

Or select based off of position instead of label

In [ ]:
df.iloc[2]

** Selecting subset of rows and columns **

In [ ]:
df.loc['B','Y']

# Getting data from other Sources

Get data from .CSV file

In [ ]:
df = pd.read_csv('Data_csv.csv')

In [ ]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

Getting data from .xls file

In [ ]:
df = pd.read_excel('Data_xls.xlsx')

In [ ]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15